### Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels=['a','b','c']

In [3]:
mylist=[10,20,30]

In [4]:
arr = np.array(mylist)
arr

array([10, 20, 30])

In [5]:
d={'a':10,'b':20,'c':30}

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(data=['a',1,1.1])

0      a
1      1
2    1.1
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],index=['USA','GERMANY','INDIA','JAPAN'])

In [12]:
ser1

USA        1
GERMANY    2
INDIA      3
JAPAN      4
dtype: int64

In [13]:
ser1['INDIA']

3

In [14]:
ser2=pd.Series([1,4,5,6],index=['USA','GERMANY','INDIA','SRI'])

In [15]:
ser2

USA        1
GERMANY    4
INDIA      5
SRI        6
dtype: int64

In [16]:
ser1 + ser2

GERMANY    6.0
INDIA      8.0
JAPAN      NaN
SRI        NaN
USA        2.0
dtype: float64

### DataFrame-Part1

In [19]:
from numpy.random import randn
np.random.seed(101)

rand_mat=randn(5,4)

In [20]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [21]:
df = pd.DataFrame(data=rand_mat)

In [22]:
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [23]:
'A B C D'.split() # fastest way for create the list

['A', 'B', 'C', 'D']

In [25]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split())

In [26]:
df

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# selecting the columns

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
type(df['W'])

pandas.core.series.Series

In [30]:
mylist=['W','Y'] # multiple columns selected
df[mylistlist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [31]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [32]:
df.W # not recoomded due methods will be confused if tab after .

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
df[['Y','W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118
C  0.528813 -2.018168
D -0.933237  0.188695
E  2.605967  0.190794

In [43]:
# create new column
df['NEW'] = df['W'] + df['Y']

In [44]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [45]:
# drop column
df.drop('NEW',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df # still new column there

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
# permently drop column
df.drop('NEW',axis=1,inplace=True)

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
# drop the row
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.drop('A',inplace=True)

In [53]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df.loc['B'] # location of rows

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [58]:
df.loc[['B','C']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [56]:
df.iloc[0]  # location of index

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [59]:
df.iloc[[0,3]]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df.loc[['B','C']][['Y','Z']]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

In [62]:
df.loc[['C','D'],['X','Y']]

          X         Y
C  0.740122  0.528813
D -0.758872 -0.933237

### DataFrame Part-2

In [63]:
# conditional selection in dataframe

In [64]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df>0

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [66]:
df_bool = df>0

In [67]:
df_bool

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [68]:
df[df_bool]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df[df>0]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df[df['W']>0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
# stacking operation
df[df['W']>0]['Y'].loc['B']

-0.8480769834036315

In [75]:
df['Y'].loc['B']

-0.8480769834036315

In [85]:
cond1 = df['W']>0
cond2 = df['W']<1

In [86]:
cond1

B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [87]:
cond2

B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [88]:
df[cond1 | cond2]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df[ cond1 & cond2 ]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df[(df['W']<0) & (df['Y']<1)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [92]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [93]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [94]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [95]:
new_index = 'CA NY WY OR'.split()

In [96]:
df['States']=new_index

In [97]:
df

          W         X         Y         Z States
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     WY
E  0.190794  1.978757  2.605967  0.683509     OR

In [98]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [99]:
df # if inplace = True then will impact on original df

          W         X         Y         Z States
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     WY
E  0.190794  1.978757  2.605967  0.683509     OR

In [104]:
df.set_index('States',inplace=True)

In [105]:
df

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to OR
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      float64
 1   X       4 non-null      float64
 2   Y       4 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [107]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [108]:
df.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean  -0.246890  0.410172  0.338367  0.413883
std    1.200715  1.220402  1.653573  0.685137
min   -2.018168 -0.758872 -0.933237 -0.589001
25%   -0.363021 -0.429207 -0.869367  0.307224
50%    0.189745  0.210402 -0.159632  0.644737
75%    0.305875  1.049781  1.048102  0.751396
max    0.651118  1.978757  2.605967  0.955057

In [109]:
df

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [110]:
df['W']>0

States
CA     True
NY    False
WY     True
OR     True
Name: W, dtype: bool